#==============================================================================
# ■ RGSS3 ソート用ID Ver1.0 by コミュ障（@hennatokoro）
#------------------------------------------------------------------------------
# 　アイテム・スキルを任意の順番で並べられるようになります。
# もうデータベースでの順番を気にする必要はありません！
# アイテムやスキルのメモ欄に
# <id>
# と入力してください。（idは任意の自然数）
# ゲーム内での表示はその数値でソートされます。
# なお、省略した場合は該当項目のデータベース上のIDを採用します。
#
# このスクリプトは、以下のクラス・モジュールを再定義しています。
# ・Window_ItemList
# ・Window_SkillList
# これらに関係するスクリプト素材を使用している場合、競合するおそれが
# ありますので、ご使用の際はご注意ください。
#==============================================================================

class Window_ItemList < Window_Selectable
#--------------------------------------------------------------------------
# ● アイテムリストの作成
#--------------------------------------------------------------------------
def make_item_list
@data = $game_party.all_items.select {|item| include?(item) }.sort_by{|item| item.s_id }
@data.push(nil) if include?(nil)
end
end
class Window_SkillList < Window_Selectable
#--------------------------------------------------------------------------
# ● スキルリストの作成
#--------------------------------------------------------------------------
def make_item_list
@data = @actor ? @actor.skills.select {|skill| include?(skill) }.sort_by{|skill| skill.s_id } : []
end
end
#==============================================================================
# ■ RPG::BaseItem
#==============================================================================
class RPG::BaseItem
#--------------------------------------------------------------------------
# ● ソート用IDの取得
#--------------------------------------------------------------------------
def s_id
return /<(\d+)>/ =~ self.note ? $1.to_i : self.id
end
end