#==============================================================================
# ■ RGSS3 接触・決定リージョン/地形タグコモンイベント Ver1.00 by 星潟
#------------------------------------------------------------------------------
# 特定のリージョンや地形タグにプレイヤーが接触したり決定キーを押した際
# 対応したコモンイベントを実行する機能を実装します。
#==============================================================================
# マップのメモ欄に指定
# <キーワード:リージョンIDもしくは地形ID,起動するコモンイベントID,条件>
# 基本セットは上記となる。
#------------------------------------------------------------------------------
# <接触RC:1,11,true>
# 
# 条件なし。
# リージョンID1は上に乗った際にコモンID11を起動する。
#------------------------------------------------------------------------------
# <直下RC:2,12,$game_switches[10]>
# 
# スイッチID10がONになっていることが条件となる。
# リージョンID2は上に乗った状態で決定キーを押した際に
# コモンイベントID12を起動する。
#------------------------------------------------------------------------------
# <目前RC:3,13,$game_variables[1]>10>
# 
# 変数ID1に格納されている値が10より大きいことが条件となる。
# リージョンID3を目の前にして決定キーを押した際に
# コモンイベントID13を起動する。
#------------------------------------------------------------------------------
# <接触TC:4,14,!$game_player.in_airship?>
# 
# プレイヤーが飛行船に乗っていないことが条件となる。
# 地形タグ4の上に乗った際にコモンID14を起動する。
#------------------------------------------------------------------------------
# <直下TC:5,15,$game_player.normal_walk?>
# 
# プレイヤーが乗り物に乗っておらず
# 移動ルートの強制もされていないことが条件となる。
# 地形タグ5の上に乗った状態で決定キーを押した際に
# コモンイベントID15を起動する。
#------------------------------------------------------------------------------
# <目前TC:6,16,$game_party.has_item?($data_items[1])>
# 
# アイテムID1を所持していることが条件となる。
# 地形タグ6を目の前にして決定キーを押した際に
# コモンイベントID16を起動する。
#==============================================================================
# 条件部分に使える例文を以下に記載しています。
# &&を間に挟むことで二つの条件を合わせられます。
# 条件分岐のスクリプトなどでも使えます。
#------------------------------------------------------------------------------
# $game_player.normal_walk?
# 
# プレイヤーが乗り物に乗っておらず
# 移動ルートの強制もされていないか？
#------------------------------------------------------------------------------
# $game_player.in_boat?
# 
# 小型船に乗っているか？
#------------------------------------------------------------------------------
# $game_player.in_ship?
# 
# 大型船に乗っているか？
#------------------------------------------------------------------------------
# $game_player.in_airship?
# 
# 飛行船に乗っているか？
#------------------------------------------------------------------------------
# !$game_player.in_airship?
# 
# 飛行船に乗っていない状態か？
#------------------------------------------------------------------------------
# $game_party.members.include?($game_actors[1])
# 
# アクターID1がメンバーに含まれているか？
#------------------------------------------------------------------------------
# !$game_party.members.include?($game_actors[2])
# 
# アクターID2がメンバーに含まれているか？
#------------------------------------------------------------------------------
# $game_actors[3].movable?
# 
# アクターID3が行動可能な状態か？
#------------------------------------------------------------------------------
# !$game_actors[4].movable?
# 
# アクターID4が行動不能な状態か？
#------------------------------------------------------------------------------
# $game_actors[5].state?(6)
# 
# アクターID5がステートID6を付与されているか？
#------------------------------------------------------------------------------
# !$game_actors[6].state?(7)
# 
# アクターID6がステートID7を付与されていないか？
#------------------------------------------------------------------------------
# $game_party.has_item?($data_items[2])
# 
# アイテムID2を所持している状態か？
#------------------------------------------------------------------------------
# $game_party.has_item?($data_weapons[3])
# 
# 武器ID3を所持している状態か？装備品は含めない。
#------------------------------------------------------------------------------
# $game_party.has_item?($data_armors[4],true)
# 
# 防具ID4を所持している状態か？装備品も含める。
#------------------------------------------------------------------------------
# !$game_party.has_item?($data_items[5])
# 
# アイテムID5を所持していない状態か？
#------------------------------------------------------------------------------
# $game_switches[1]
# 
# スイッチID1がONか？
#------------------------------------------------------------------------------
# !$game_switches[1]
# 
# スイッチID1がOFFか？
#------------------------------------------------------------------------------
# $game_variables[2]==0
# 
# 変数ID2に格納されている値が0か？
#------------------------------------------------------------------------------
# $game_variables[3]!=0
# 
# 変数ID3に格納されている値が0以外か？
#------------------------------------------------------------------------------
# $game_variables[4]<=0
# 
# 変数ID4に格納されている値が0以下か？
#------------------------------------------------------------------------------
# $game_variables[5]>=0
# 
# 変数ID5に格納されている値が0以上か？
#------------------------------------------------------------------------------
# $game_variables[6]<0
# 
# 変数ID6に格納されている値が0未満か？
#------------------------------------------------------------------------------
# $game_variables[7]>0
# 
# 変数ID7に格納されている値が0より大きいか？
#------------------------------------------------------------------------------
# $game_player.dash?
# 
# ダッシュしているか？
#==============================================================================
# &&を間に挟むことで二つの条件を合わせられます。
# 条件分岐のスクリプトなどでも使えます。
#------------------------------------------------------------------------------
# $game_player.normal_walk?&&$game_switches[1]
# 
# プレイヤーが乗り物に乗っておらず移動ルートの強制もされておらず
# スイッチID1がONになっているか？
#==============================================================================
module RegionCommonEvent
  
  #初期設定用のハッシュを作成(変更不要)
  
  RC = {0 => {},1 => {},2 => {}}
  TC = {0 => {},1 => {},2 => {}}
  
  #接触リージョンコモンイベントの設定用キーワードを指定
  
  Word1 = "接触RC"
  
  #直下リージョンコモンイベントの設定用キーワードを指定
  
  Word2 = "直下RC"
  
  #目前リージョンコモンイベントの設定用キーワードを指定
  
  Word3 = "目前RC"
  
  #接触地形タグコモンイベントの設定用キーワードを指定
  
  Word4 = "接触TC"
  
  #直下地形タグコモンイベントの設定用キーワードを指定
  
  Word5 = "直下TC"
  
  #目前地形タグコモンイベントの設定用キーワードを指定
  
  Word6 = "目前TC"
  
  #全マップ共通設定の指定
  #マップのメモ欄側で同じ部分への設定がある場合
  #マップのメモ欄側を優先する。
  
  #例1.
  #RC[0][1] = {:id => 11,:c => "true"}
  #この場合、全マップにおいて
  #<接触RC:1,11,true>
  #こう記載するのと同じ効果を得る。
  
  #例2.
  #RC[1][2] = {:id => 12,:c => "$game_switches[10]"}
  #この場合、全マップにおいて
  #<直下RC:2,12,$game_switches[10]>
  #こう記載するのと同じ効果を得る。
  
  #例3.
  #RC[2][3] = {:id => 13,:c => "$game_variables[1] > 10"}
  #この場合、全マップにおいて
  #<目前RC:3,13,$game_variables[1]>10>
  #こう記載するのと同じ効果を得る。
  
  #例4.
  #TC[0][4] = {:id => 14,:c => "!$game_player.in_airship?"}
  #この場合、全マップにおいて
  #<接触TC:4,14,!$game_player.in_airship?>
  #こう記載するのと同じ効果を得る。
  
  #例5.
  #TC[1][5] = {:id => 15,:c => "$game_player.normal_walk?"}
  #この場合、全マップにおいて
  #<直下TC:5,15,!$game_player.normal_walk?>
  #こう記載するのと同じ効果を得る。
  
  #例6.
  #TC[2][6] = {:id => 16,:c => "$game_party.has_item?($data_items[1])"}
  #この場合、全マップにおいて
  #<目前TC:6,16,$game_party.has_item?($data_items[1])>
  #こう記載するのと同じ効果を得る。
  
  RC[0][1] = {:id => 14,:c => "true"}
  RC[1][1] = {:id => 15,:c => "true"}
  RC[2][1] = {:id => 16,:c => "true"}
  
  #--------------------------------------------------------------------------
  # キーワード配列1を作成
  #--------------------------------------------------------------------------
  def self.words1
    @words1 ||= [Word1,Word2,Word3]
  end
  #--------------------------------------------------------------------------
  # キーワード配列2を作成
  #--------------------------------------------------------------------------
  def self.words2
    @words2 ||= [Word4,Word5,Word6]
  end
end
class Game_Player < Game_Character
  #--------------------------------------------------------------------------
  # 接触（重なり）によるイベント起動判定
  #--------------------------------------------------------------------------
  alias check_touch_event_region_common_event check_touch_event
  def check_touch_event
    return if check_touch_event_region_common_event
    if !($game_map.interpreter.running? or $game_map.any_event_starting?) &&
      SceneManager.scene.is_a?(Scene_Map)
      rid = $game_map.region_id(@x,@y)
      $game_map.reserve_region_common_event(0,rid)
      $game_map.setup_starting_event
      if !($game_map.interpreter.running? or $game_map.any_event_starting?) &&
        SceneManager.scene.is_a?(Scene_Map)
        tt = $game_map.terrain_tag(@x,@y)
        $game_map.reserve_terrain_tag_common_event(0,tt)
        $game_map.setup_starting_event
      end
    end
  end
  #--------------------------------------------------------------------------
  # 決定ボタンによるイベント起動判定
  #--------------------------------------------------------------------------
  alias check_action_event_region_common_event check_action_event
  def check_action_event
    return if check_action_event_region_common_event
    if region_terrain_tag_common_event_next_check_enable?
      rid = $game_map.region_id(@x,@y)
      $game_map.reserve_region_common_event(1,rid)
      $game_map.setup_starting_event
      if region_terrain_tag_common_event_next_check_enable?
        tt = $game_map.terrain_tag(@x,@y)
        $game_map.reserve_terrain_tag_common_event(1,tt)
        $game_map.setup_starting_event
        if region_terrain_tag_common_event_next_check_enable?
          x2 = $game_map.round_x_with_direction(@x, @direction)
          y2 = $game_map.round_y_with_direction(@y, @direction)
          rid = $game_map.region_id(x2,y2)
          $game_map.reserve_region_common_event(2,rid)
          $game_map.setup_starting_event
          if region_terrain_tag_common_event_next_check_enable?
            tt = $game_map.terrain_tag(x2,y2)
            $game_map.reserve_terrain_tag_common_event(2,tt)
            $game_map.setup_starting_event
          end
        end
      end
    end
  end
  #--------------------------------------------------------------------------
  # リージョン/地形タグコモンイベントの実行可否判定
  #--------------------------------------------------------------------------
  def region_terrain_tag_common_event_next_check_enable?
    !($game_map.interpreter.running? or $game_map.any_event_starting?) &&
    SceneManager.scene.is_a?(Scene_Map)
  end
end
class Game_Map
  #--------------------------------------------------------------------------
  # リージョンコモンイベントの予約
  #--------------------------------------------------------------------------
  def reserve_region_common_event(type,region_id)
    cid = @map.region_common_event[type][region_id]
    return unless cid && cid[:c] && eval(cid[:c])
    $game_temp.reserve_common_event(cid[:id])
  end
  #--------------------------------------------------------------------------
  # 地形タグコモンイベントの予約
  #--------------------------------------------------------------------------
  def reserve_terrain_tag_common_event(type,terrain_tag)
    cid = @map.terrain_tag_common_event[type][terrain_tag]
    return unless cid && cid[:c] && eval(cid[:c])
    $game_temp.reserve_common_event(cid[:id])
  end
end
class RPG::Map
  #--------------------------------------------------------------------------
  # リージョンコモンイベント
  #--------------------------------------------------------------------------
  def region_common_event
    @region_common_event ||= create_region_common_event
  end
  #--------------------------------------------------------------------------
  # リージョンコモンイベントデータ作成
  #--------------------------------------------------------------------------
  def create_region_common_event
    h = Marshal.load(Marshal.dump(RegionCommonEvent::RC))
    note.each_line {|l|
    RegionCommonEvent.words1.each_with_index {|t,i|
    next unless /<#{t}[:：](\d+),(\d+),(\S+)>/ =~ l
    h[i][$1.to_i] = {:id => $2.to_i,:c => $3.to_s}}}
    h
  end
  #--------------------------------------------------------------------------
  # 地形タグコモンイベント
  #--------------------------------------------------------------------------
  def terrain_tag_common_event
    @terrain_tag_common_event ||= create_terrain_tag_common_event
  end
  #--------------------------------------------------------------------------
  # 地形タグコモンイベントデータ作成
  #--------------------------------------------------------------------------
  def create_terrain_tag_common_event
    h = Marshal.load(Marshal.dump(RegionCommonEvent::TC))
    note.each_line {|l|
    RegionCommonEvent.words2.each_with_index {|t,i|
    next unless /<#{t}[:：](\d+),(\d+),(\S+)>/ =~ l
    h[i][$1.to_i] = {:id => $2.to_i,:c => $3.to_s}}}
    h
  end
end